МУИВРазработка_системы_тестирования_обучающихся_на_базе_платформы_1СПредприятиеv2/src/Catalogs/ТС_Студенты/ТС_Студенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ТС_Студенты</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДобавлятьОшибочныеВИзбранные</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПереходитьКСледующемуПриВыборе</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверятьТестПриВыборе</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеВыделятьОтмеченныеТесты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеВыделятьОтмеченныеТестыТолькоДляВебКлиента</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОткрыватьФормуТестированияВНовомОкне</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОткрыватьФормуТестированияВНовомОкнеТолькоДляВебКлиента</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ШиринаФормыТестирования</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШиринаФормыТестированияТолькоДляВебКлиента</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

МУИВРазработка_системы_тестирования_обучающихся_на_базе_платформы_1СПредприятиеv2/src/Catalogs/ТС_Студенты/Forms/ФормаЭлемента/Module.bsl
#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.Группа2.Видимость = Константы.ТС_ИспользоватьИзбранныеТесты.Получить();
	
КонецПроцедуры

 #КонецОбласти

#Область ДействияФормы

&НаКлиенте
Процедура НеВыделятьОтмеченныеТестыПриИзменении(Элемент)
	
	Объект.НеВыделятьОтмеченныеТестыТолькоДляВебКлиента = Объект.НеВыделятьОтмеченныеТесты;
		
КонецПроцедуры

&НаКлиенте
Процедура ОткрыватьФормуТестированияВНовомОкнеПриИзменении(Элемент)
	
	Объект.ОткрыватьФормуТестированияВНовомОкнеТолькоДляВебКлиента = Объект.ОткрыватьФормуТестированияВНовомОкне;
	
КонецПроцедуры

&НаКлиенте
Процедура ШиринаФормыТестированияПриИзменении(Элемент)
	
	Объект.ШиринаФормыТестированияТолькоДляВебКлиента = ?(Объект.ШиринаФормыТестирования=0,Ложь,Истина);
	
КонецПроцедуры

#КонецОбласти
